/*
Java程序可分为Java应用程序(Application)和Java小应用程序(Applet)
特点：面向对象，解释型，跨平台性，可移植性，安全性，多线程，高性能，分布式

面向过程：以过程为中心，以算法为驱动，以数据结构为基础
面向对象：以对象为中心，以类为驱动，以消息为驱动

Java程序开发步骤
1. 编写源文件：文件名.java
2. 编译器(javac）：编译java代码
3. 得到字节码文件：文件名.class
4. 解释器：解释字节码文件

一个Java应用程序必须有一个类含有public static void main(String args[])方法，
称这个类是应用程序的主类
piblic是访问修饰符，表示该类可以被其他类访问
static表示该方法是静态方法，可以直接通过类名调用
void表示该方法没有返回值
main是方法名
String args[]是参数，表示该方法可以接受一个字符串数组作为参数

如果源文件中有多个类，那么只能有一个类是public类
如果有一个类是public类，那么源文件名必须和这个类的名字完全相同，扩展名是java
如果源文件没有public类，那么源文件的名字只要和某个类的名字相同，并且扩展名是java就可以了


*/